app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("title", "category", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "husa"], ["category", "hjioahf"], ["body", "djdhhdah"], ["created_at", "2020-01-12 07:19:48.340038"], ["updated_at", "2020-01-12 07:19:48.340038"]]
---
  def create
  	blog = Blog.new(blog_params)
  	blog.save

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
  	blog = Blog.find(params[:id])

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 1]]
---
  def destroy
    blog = Blog.find(params[:id])
    blog.destroy